Revit 2022 API
BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUniqueViewport Property
 Multiple instances of the same view in sheets not supported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyMustBeUniqueViewport { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyMustBeUniqueViewport As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyMustBeUniqueViewport {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace